app/views/pools/show.html.erb

<p style="margin-left:50px;">
	<% if @pool.games.count == 0 %>
---
SELECT "games".* FROM "games" WHERE "games"."pool_id" = ?  [["pool_id", 1]]
SELECT COUNT(*) FROM "games" WHERE "games"."pool_id" = ?  [["pool_id", 3]]