app/controllers/games_controller.rb

INSERT INTO "games" ("created_at", "pool_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 09 Apr 2014 16:53:54 UTC +00:00], ["pool_id", 3], ["updated_at", Wed, 09 Apr 2014 16:53:54 UTC +00:00], ["user_id", 1]]
---
	  def create
    	@game = current_user.games.build(pool_id: params[:pool_id])# :conditions => ["user_id != ?", current_user.id, "pool_id !=?", pool_id]
      if @game.save