app/controllers/pools_controller.rb

  def index
    @pools = Pool.all
---
SELECT "pools".* FROM "pools"

  def show
    @user = User.find_by(params[:id])
    @pools = Pool.all
    @games = Game.where(params[:pool_id])

    ## Creates an Array Of User_IDs to later be randomly selected
          @entrants = []
            games = Pool.find_by(params[:id]).games
              ids = games.each do |game|
---
SELECT "users".* FROM "users" WHERE (1) LIMIT 1
SELECT "pools".* FROM "pools" WHERE (1) LIMIT 1
SELECT "games".* FROM "games" WHERE "games"."pool_id" = ?  [["pool_id", 1]]
SELECT "games".* FROM "games" LIMIT 1

  def create
    @pool = Pool.new(pool_params)
    respond_to do |format|
      if @pool.save
---
INSERT INTO "pools" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 08 Apr 2014 05:47:24 UTC +00:00], ["name", "Lunch At La Esquina"], ["updated_at", Tue, 08 Apr 2014 05:47:24 UTC +00:00]]

  def update
    respond_to do |format|
      if @pool.update(pool_params)
---
UPDATE "pools" SET "name" = ?, "updated_at" = ? WHERE "pools"."id" = 1  [["name", "Dinner OverThere"], ["updated_at", Tue, 08 Apr 2014 22:10:34 UTC +00:00]]

  def destroy
    @pool.destroy
---
DELETE FROM "pools" WHERE "pools"."id" = ?  [["id", 5]]

    def set_pool
      @pool = Pool.find(params[:id])
---
SELECT "pools".* FROM "pools" WHERE "pools"."id" = ? LIMIT 1  [["id", "5"]]